Отлично! Вперёд к уроку 20! 🚀

---

# 🔹 Урок 20. Потоки исполнения (Threads) и многопоточность 🧵🧠

---

## 🧩 Тема урока:

Сегодня мы разберёмся с одним из краеугольных камней современных многозадачных операционных систем — **потоками**. В отличие от процессов, потоки — это "лёгкие единицы исполнения", которые разделяют адресное пространство и другие ресурсы между собой. Поговорим о многопоточности, её преимуществах, вызовах, синхронизации и современных реализациях на уровне ОС и железа в 2025 году.

---

## 🧠 Теоретическое описание (≈2500 слов)

### Разделение понятий: процесс и поток

* Процесс — единица ресурсного управления
* Поток — единица исполнения
* Почему потоки "дешевле", чем процессы
* Один процесс — много потоков: зачем это нужно?

---

### Структура потока

* Что включает поток: стек, регистры, счётчик команд
* Как ОС отслеживает потоки (TID, PCB/TCB)
* Отношения между потоками и родительским процессом

---

### Создание и завершение потоков

* Платформы: POSIX Threads (pthreads), Windows threads
* Современные API: C23 `std::thread` (или аналоги через обёртки)
* Жизненный цикл потока

---

### Планирование и исполнение

* Как ОС планирует потоки
* User-level threads vs Kernel-level threads
* Реализация в современных ОС: Linux, Windows, macOS
* Особенности многопоточности на ARM и x86-64

---

### Проблемы многопоточности

* Гонки данных
* Взаимные блокировки
* Проблема ABA
* Вопросы производительности и контекст-переключений

---

### Средства синхронизации

* Мьютексы, семафоры, спинлоки
* Барьеры, условные переменные
* Атомарные операции и память (memory model)
* Использование библиотек (например, C23 `<threads.h>`, OpenMP)

---

### Современные тренды (2025)

* Аппаратная поддержка параллелизма
* Многопоточность в многопроцессорных и гетерогенных системах
* Thread-per-core модели
* Использование потоков в микросервисах, AI и IoT

---

## 📘 Рекомендуемые материалы:

* POSIX Threads Programming Guide
* Документация по `<threads.h>` из C23
* Intel и AMD Developer Manuals: Threading and Core Management
* Linux Kernel Development (про TCB)
* Книга «Multithreaded Programming with C and POSIX Threads»

---

## 💡 Практическое задание:

🔨 Задачи:

1. Написать программу, создающую 5 потоков и выполняющую параллельную задачу
2. Использовать мьютекс для защиты общего ресурса
3. Сравнить производительность с однопоточной версией
4. Реализовать простую модель "производитель-потребитель" с помощью условных переменных

---

## 💻 Пример кода (C23):

```c
#include <stdio.h>
#include <stdlib.h>
#include <threads.h>
#include <stdatomic.h>

#define NUM_THREADS 5

mtx_t lock;
atomic_int shared_counter = 0;

int thread_func(void* arg) {
    int id = *(int*)arg;

    for (int i = 0; i < 5; i++) {
        mtx_lock(&lock);
        shared_counter++;
        printf("Поток %d увеличил счетчик до %d\n", id, shared_counter);
        mtx_unlock(&lock);
        thrd_sleep(&(struct timespec){.tv_sec = 0, .tv_nsec = 500000000}, NULL); // 0.5 сек
    }

    return 0;
}

int main() {
    thrd_t threads[NUM_THREADS];
    int ids[NUM_THREADS];

    if (mtx_init(&lock, mtx_plain) != thrd_success) {
        fprintf(stderr, "Ошибка инициализации мьютекса\n");
        return 1;
    }

    for (int i = 0; i < NUM_THREADS; i++) {
        ids[i] = i + 1;
        if (thrd_create(&threads[i], thread_func, &ids[i]) != thrd_success) {
            fprintf(stderr, "Не удалось создать поток %d\n", i + 1);
        }
    }

    for (int i = 0; i < NUM_THREADS; i++) {
        thrd_join(threads[i], NULL);
    }

    mtx_destroy(&lock);
    printf("Итоговое значение счётчика: %d\n", shared_counter);

    return 0;
}
```

---

## 🧠 Уровень сложности: 7/10

---

## ⏱ Время на изучение: 8 часов

* Теория: 5 ч
* Практика: 3 ч

---

## 🧑‍🏫 Методика преподавания:

* Лекция с диаграммами архитектуры потоков
* Демонстрация гонок данных и синхронизации
* Работа в лаборатории с pthreads и C23
* Домашнее задание: реализовать многопоточную очередь задач

---

Готов к **уроку 21**? Просто скажи **да** — и мы продолжаем! 🚀
