Отлично, продолжаем!

---

# 🔹 Урок 4. Архитектура x86 и основы работы с регистрами процессора 🖥️🔧

---

## 🧩 Тема урока:

Погружаемся в архитектуру процессоров семейства x86 — разберём структуру регистров, режимы работы, операции с ними. Узнаем, как управлять процессором на низком уровне для создания ОС.

---

## 🧠 Теоретическое описание (≈2500–3000 слов)

### Введение в архитектуру x86

Архитектура x86 — одна из самых популярных и широко используемых в мире, начиная с Intel 8086 (1978) до современных 64-битных процессоров. Это CISC-архитектура, которая сочетает сложные инструкции и широкие возможности.

---

### Основные регистры процессора

* **Общие регистры (General Purpose Registers, GPRs):**

  * AX, BX, CX, DX — 16-битные базовые регистры (расширяются в EAX, EBX, ECX, EDX для 32-битного режима и RAX, RBX и т.д. — для 64-битного)

  * Используются для арифметики, адресации, передачи данных
* **Сегментные регистры:**

  * CS (код сегмент), DS (данные), SS (стек), ES, FS, GS

  * Управляют сегментами памяти, важны для реального и защищённого режимов
* **Регистры указателя и индекса:**

  * SP (stack pointer), BP (base pointer), SI (source index), DI (destination index)
* **Регистры состояния (флаговые регистры):**

  * EFLAGS / RFLAGS

  * Отвечают за состояние процессора: флаги переноса, нуля, знака, прерываний и др.

---

### Режимы работы процессора

* **Реальный режим (Real Mode):**
  16-битный, сегментная адресация, нет защиты памяти, совместимость с DOS

* **Защищённый режим (Protected Mode):**
  32-битный, поддержка виртуальной памяти, многозадачность, защита памяти

* **Долгий режим (Long Mode):**
  64-битный режим с расширенными возможностями и регистровым набором

---

### Особенности управления регистрами

* Регистры можно использовать как целиком, так и по частям (например, AL и AH — младший и старший байт регистра AX)

* Использование регистров для адресации памяти через сложные вычисления

---

### Инструкции работы с регистрами

* MOV, PUSH, POP — операции с передачей данных и стеком
* ADD, SUB, INC, DEC — арифметика
* CMP и Jcc — сравнения и переходы
* IN, OUT — работа с портами ввода-вывода

---

### Пример использования регистров в загрузчике

Загрузка из BIOS требует манипуляций с сегментными регистрами и использованием стека, чтобы сохранить состояние.

---

### Современные тенденции (2025)

* Поддержка новых расширений (AVX-512, SMEP/SMAP) для безопасности и производительности
* Энергосбережение и управление энергией через регистры управления процессором
* Безопасность: контроль исполнения, защита от атак типа Spectre/Meltdown

---

## 📘 Рекомендуемые материалы:

* Intel® 64 and IA-32 Architectures Software Developer’s Manual
* OSDev wiki: Registers ([ссылка](https://wiki.osdev.org/Registers))
* Книга “Intel Assembly Language Programming”
* Статьи о современных расширениях процессоров (AVX, SMEP, SMAP)

---

## 💡 Практические задачи:

* Написать программу на Си, выводящую значение регистров процессора (через inline asm)
* Создать простой ассемблерный код с манипуляцией сегментными регистрами
* Написать функцию переключения между режимами с использованием регистров управления

---

## 💻 Пример кода на Си23 с комментариями:

```c
#include <stdio.h>

void print_registers() {
    unsigned int eax, ebx, ecx, edx;
    __asm__ volatile (
        "movl %%eax, %0\n\t"
        "movl %%ebx, %1\n\t"
        "movl %%ecx, %2\n\t"
        "movl %%edx, %3\n\t"
        : "=r"(eax), "=r"(ebx), "=r"(ecx), "=r"(edx)
        :
        : // Нет изменяемых регистров
    );
    printf("EAX = 0x%X\nEBX = 0x%X\nECX = 0x%X\nEDX = 0x%X\n", eax, ebx, ecx, edx);
}

int main() {
    print_registers();
    return 0;
}
```

---

## 🧠 Уровень сложности: 6/10

---

## ⏱ Время на изучение: 5–7 часов

* Теория: 3 ч
* Практика: 2–4 ч

---

## 🧑‍🏫 Методика:

* Лекция с разбором регистров и демонстрацией
* Разбор примеров ассемблерного кода
* Самостоятельная работа с регистрами и переходами
* Домашнее задание: реализовать и объяснить функции работы с регистрами

---

🔥 Готов продолжить с уроком 5? Напиши **да**!
